src/DataProcessors/ГенерацияДанныхИТест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ГенерацияДанныхИТест</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/AccountingRegisters/РегистрБухгалтерии1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>РегистрБухгалтерии1</Name>
			<ChartOfAccounts>ChartOfAccounts.ПланСчетов1</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/DataProcessors/ГенерацияДанныхИТест/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ГенерацияДанныхНаСервере(Дата) 
	ДатаТеста = НачалоМесяца(ДобавитьМесяц(Дата,-1));
	Для Сч = 1 По 10 Цикл
		ДокОб = Документы.Документ1.СоздатьДокумент();
		ДокОб.Дата = ДатаТеста + Сч * 3;
		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	ДатаТеста = НачалоМесяца(Дата);
	Для Сч = 1 По 10000 Цикл
		ДокОб = Документы.Документ1.СоздатьДокумент();
		ДокОб.Дата = ДатаТеста + Сч * 3;
		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;  
	
	ДатаТеста = Дата;
	ДокОб = Документы.Документ2.СоздатьДокумент();
	ДокОб.Дата = ДатаТеста + 10001 * 3;
	ДокОб.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ГенерацияДанных(Команда)
	ГенерацияДанныхНаСервере(Объект.Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапросОстатковНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СУММА(Влож.СуммаОборот) КАК СуммаОборот,
	                      |	СУММА(Влож.СуммаОборот2) КАК СуммаОборот2
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		РегистрБухгалтерии1Обороты.СуммаОборот,
	                      |		0 КАК СуммаОборот2
	                      |	ИЗ
	                      |		РегистрБухгалтерии.РегистрБухгалтерии1.Обороты(&Дата, &Дата3, , Счет = ЗНАЧЕНИЕ(ПланСчетов.ПланСчетов1.Выручка), , ) КАК РегистрБухгалтерии1Обороты
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		0,
	                      |		РегистрБухгалтерии1.Сумма
	                      |	ИЗ
	                      |		РегистрБухгалтерии.РегистрБухгалтерии1 КАК РегистрБухгалтерии1
	                      |	ГДЕ
	                      |		РегистрБухгалтерии1.Период >= &Дата
	                      |		И РегистрБухгалтерии1.Период < &Дата2
	                      |		И РегистрБухгалтерии1.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ПланСчетов1.Выручка)) КАК Влож"); 
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ДатаТеста));  
	Запрос.УстановитьПараметр("Дата2", НачалоМесяца(ДобавитьМесяц(ДатаТеста,1)));
	Запрос.УстановитьПараметр("Дата3", НачалоМесяца(ДобавитьМесяц(ДатаТеста,1))-1);
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Сообщить("За " + формат(Запрос.Параметры.Дата, "ДФ='MMММ yyyy'") + " движения за месяц " + сокрлп(Выб.СуммаОборот2));
		Сообщить("За " + формат(Запрос.Параметры.Дата, "ДФ='MMММ yyyy'") + " оборот в итогах за месяц " + сокрлп(Выб.СуммаОборот));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОстатков(Команда)
	ЗапросОстатковНаСервере(Объект.Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестИсправленныйНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);                  
	НачСуммаДельта = -1000;
	Шаг = 10;                  
	КонСуммаДельта = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РегистрБухгалтерии1.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрБухгалтерии.РегистрБухгалтерии1 КАК РегистрБухгалтерии1
	                      |ГДЕ
	                      |	РегистрБухгалтерии1.Период < &Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РегистрБухгалтерии1.Период УБЫВ");
	Запрос.УстановитьПараметр("Дата", КонецМесяца(ДатаТеста));
	Выборка = Запрос.Выполнить().Выбрать();                          
	
	Набор = РегистрыБухгалтерии.РегистрБухгалтерии1.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Использование = Истина; //вроде и так Истина  
	
	ПереставитьГраницуВФоне.ПереставитьГраницуВФонеСБлокировкой(КонецМесяца(ДобавитьМесяц(ДатаТеста,-1)));
	
	Парам = Новый Массив;    
	Парам.Добавить(ДобавитьМесяц(КонецМесяца(ДобавитьМесяц(ДатаТеста,-1)), 1));
	ФоновыеЗадания.Выполнить("ПереставитьГраницуВФоне.ПереставитьГраницуВФонеСБлокировкой", Парам);
		
	Если Выборка.Следующий() Тогда
		Набор.Отбор.Регистратор.Значение = Выборка.Регистратор;
		Набор.Прочитать();     
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Сумма1 = Набор[0].Сумма;  
		
		СуммаДельта = НачСуммаДельта;
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Начало", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + НачСуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");  
		
		Пока СуммаДельта < КонСуммаДельта Цикл    
			СуммаДельта = СуммаДельта + Шаг;
			Набор[0].Сумма = Сумма1 + СуммаДельта; 
			Попытка
				Набор.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;                
		
		СуммаДельта = КонСуммаДельта;
		Набор[0].Сумма = Сумма1 + СуммаДельта;
		Попытка
			Набор.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		КонецПопытки;
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Окончание", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + СуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");      
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестИсправленный(Команда)
	ТестИсправленныйНаСервере(Объект.Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестВоспроизведенияОшибкиНаСервере(Дата)
	ДатаТеста = НачалоМесяца(Дата);                  
	НачСуммаДельта = -1000;
	Шаг = 10;                  
	КонСуммаДельта = 0;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РегистрБухгалтерии1.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрБухгалтерии.РегистрБухгалтерии1 КАК РегистрБухгалтерии1
	                      |ГДЕ
	                      |	РегистрБухгалтерии1.Период < &Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РегистрБухгалтерии1.Период УБЫВ");
	Запрос.УстановитьПараметр("Дата", КонецМесяца(ДатаТеста));
	Выборка = Запрос.Выполнить().Выбрать();                          
	
	Набор = РегистрыБухгалтерии.РегистрБухгалтерии1.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Использование = Истина; //вроде и так Истина  
	
	ПереставитьГраницуВФоне.ПереставитьГраницуВФонеСБлокировкой(КонецМесяца(ДобавитьМесяц(ДатаТеста,-1)));
	
	Парам = Новый Массив;    
	Парам.Добавить(ДобавитьМесяц(КонецМесяца(ДобавитьМесяц(ДатаТеста,-1)), 1));
	ФоновыеЗадания.Выполнить("ПереставитьГраницуВФоне.ПереставитьГраницуВФоне", Парам);
	
	Если Выборка.Следующий() Тогда
		Набор.Отбор.Регистратор.Значение = Выборка.Регистратор;
		Набор.Прочитать();     
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Сумма1 = Набор[0].Сумма;  
		
		СуммаДельта = НачСуммаДельта;
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Начало", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + НачСуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");  
		
		Пока СуммаДельта < КонСуммаДельта Цикл    
			СуммаДельта = СуммаДельта + Шаг;
			Набор[0].Сумма = Сумма1 + СуммаДельта;
			Попытка
				Набор.Записать();
			Исключение  
				ЗаписьЖурналаРегистрации("Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;                
		
		СуммаДельта = КонСуммаДельта;
		Набор[0].Сумма = Сумма1 + СуммаДельта;
		Попытка
			Набор.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		КонецПопытки;
		
		//ЗаписьЖурналаРегистрации("ОшибкаИтогов.ИзменениеДвижений.Окончание", УровеньЖурналаРегистрации.Ошибка,,
		//,"Сумма = Сумма + СуммаДельта (" 
		//+ сокрлп(Сумма1 + СуммаДельта) + " = " 
		//+ сокрлп(Сумма1) + " + " 
		//+ сокрлп(СуммаДельта) + ")");      
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестВоспроизведенияОшибки(Команда)
	ТестВоспроизведенияОшибкиНаСервере(Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.Дата = Дата(2022,09,15);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РегистрыБухгалтерии.РегистрБухгалтерии1.ПолучитьИспользованиеТекущихИтогов() Тогда
		РегистрыБухгалтерии.РегистрБухгалтерии1.УстановитьИспользованиеТекущихИтогов(Ложь);
	КонецЕсли;
КонецПроцедуры
